Web/PHP_and_MySQL_Server_Side_Web_Development/001.Variables_Expressions_and_Operators/001.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-11-03 Mon 21:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 1: Variables, Expressions &amp; Operators</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Chapter 1: Variables, Expressions &amp; Operators</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0e75149">Navigation</a></li>
<li><a href="#org2859686">Notes</a>
<ul>
<li><a href="#org66fcb2d">Section 1.1: Introduction</a></li>
<li><a href="#org5d1c942">Section 1.2: Static vs. Dynamic Websites</a></li>
</ul>
</li>
<li><a href="#org1e9834c">Keywords</a></li>
<li><a href="#org9eec546">Questions</a></li>
<li><a href="#orgadb6512">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0e75149" class="outline-2">
<h2 id="org0e75149">Navigation</h2>
<div class="outline-text-2" id="text-org0e75149">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../../../index.html">html</a> &vert; <a href="../../../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">PHP &amp; MySQL - Server Side Web Development</td>
<td class="org-left">&vert; <a href="../000.Home.html">html</a> &vert; <a href="../000.Home.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/HTML_and_CSS_Design_and_Build_Websites">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Next</td>
<td class="org-left">Chapter 2: Control Structures</td>
<td class="org-left">&vert; <a href="../002.Control_Structures/002.000.Notes.html">html</a> &vert; <a href="../002.Control_Structures/002.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/PHP_and_MySQL_Server_Side_Web_Development/002.Control_Structures">github</a> &vert;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2859686" class="outline-2">
<h2 id="org2859686">Notes</h2>
<div class="outline-text-2" id="text-org2859686">
</div>
<div id="outline-container-org66fcb2d" class="outline-3">
<h3 id="org66fcb2d">Section 1.1: Introduction</h3>
<div class="outline-text-3" id="text-org66fcb2d">
<ul class="org-ul">
<li>PHP is a programming language that was designed to run on a web server so that when someone requests a web page, the server can generate an HTML page to send back to that specific user</li>
<li>This means that pages can be tailored to individual people which is a requirement for any site that allows users to perform tasks such as register or log in, making purchases, or even searching within the website</li>
<li>PHP was designed to work with databases like MySQL which can store data such as the content of the pages the site displays, the products a site sells, or details about members of the site</li>
<li>Using PHP, web pages can allow members to update the data stored in the database such as content management systems, online shops, or social networks</li>
<li>Websites that store their information that is displayed in a database are called database-driven websites</li>
</ul>
</div>
</div>

<div id="outline-container-org5d1c942" class="outline-3">
<h3 id="org5d1c942">Section 1.2: Static vs. Dynamic Websites</h3>
</div>
</div>

<div id="outline-container-org1e9834c" class="outline-2">
<h2 id="org1e9834c">Keywords</h2>
<div class="outline-text-2" id="text-org1e9834c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Database-driver Websites</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org9eec546" class="outline-2">
<h2 id="org9eec546">Questions</h2>
<div class="outline-text-2" id="text-org9eec546">
<ul class="org-ul">
<li><b>Q</b>: Does PHP return a HTML file that is already created or does PHP generate a HTML file and return that file to the client? Or can PHP do both?</li>
</ul>
</div>
</div>

<div id="outline-container-orgadb6512" class="outline-2">
<h2 id="orgadb6512">Summary</h2>
</div>
</div>
</body>
</html>
